# list of brew packages
# install with `brew bundle install`
# tap:  Add more brew third-party repos
# cask: Install application casks (Gimp, etc.)
# brew: Install packages
# mas:  Install App store items (requires brew install mas)

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

cask "alacritty"

brew "node"
brew "coreutils"
brew "readline"
brew "docutils"
brew "fish"
brew "htop"
brew "llvm"
brew "python@3.8"
brew "reattach-to-user-namespace"
brew "neovim"
brew "tmux"

brew "fd"
brew "exa"
brew "rg"
brew "bat"

brew "font-fira-code-nerd-font"

# notifications so Done fish plugin works
brew "terminal-notifier"
